// Task-2-4-ru.cpp : Этот файл содержит функцию 'main'. Выполнение программы начинается и заканчивается здесь.
//
#include <iostream>
#include <locale>

int main(int argc, char* argv[])
{
    unsigned int max_len = 0;  // Максимальная длина участка, где каждая волна длинее предыдущей
    unsigned int current_len = 0;  // Текущая длина участка, где каждая волна длинее предыдущей
    unsigned int prev_wave = 0;  // Предыдущее значение в цепочке вводимых данных
    bool b_done = false;  // Флаг контроля выполнения цикла
    // Установка русской локали для терминала Windows 11
    system("chcp 65001 >nul");// 1-й способ. Выплнить внешнюю команду.
    setlocale(LC_ALL, "russian.65001"); // 2 - й способ. Вызов библиотечной функции.
    std::locale rus_locale = std::locale("russian.65001"); // 3 - й способ. Создать переменную типа локали
    std::cout.imbue(std::locale::global(rus_locale)); // 3 - й способ. Выбор кодировки(локали) терминала
    // Ввод данных
    std::cout << "Введите данные метеостанции (0 - конец ввода).\r\n";
    while (!b_done)  // Старт цикла
    {
        unsigned int wave; // перемменая для данных
        std::cin >> wave;  // Ввод новой порции данных
        b_done = (wave == 0);  // Условие окончания цикла - ввод 0
        if (current_len == 0)
        {
            current_len = 1;  // Счётчик длины установили в 1
        }
        else if (wave > prev_wave) // если каждая волна длинее предыдущей
        {
            current_len += 1; // то счётчик длины участка увеличить на 1
        }
        else
        {
            if (current_len > max_len)  // В противном случае вычислить
            {
                max_len = current_len;  // максимальную длину участка
            }
            current_len = 1;  // и сбросить счётчик текущей длины участка
        }
        prev_wave = wave;  // Предыдущее значение заменить новым
    }
    // Максимальная длина участка, где каждая волна длинее предыдущей
    // Окончательный ответ
    if (current_len > max_len)
    {
        max_len = current_len;
    }
    std::cout << "Максимальная длина участка: " << max_len;
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», чтобы добавить существующие файлы кода в проект